// BSLLS:UnusedLocalMethod-off

#Использовать autumn
#Использовать asserts
#Использовать ".."

Процедура ПередЗапускомТеста()
	Сообщить("Перед запуском теста");
КонецПроцедуры

Процедура ПослеЗапускаТеста()
	Сообщить("После запуска теста");
КонецПроцедуры

Функция ПолучитьПоделку()

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();
	Возврат Поделка;

КонецФункции

&Тест
Процедура ПроверитьЧтоПустыеКонфигурацииИдентичны() Экспорт

	// Дано

	Поделка = ПолучитьПоделку();
	ОписаниеОбъекта1 = Поделка.НайтиЖелудь("ОписаниеОбъекта");
	ОписаниеОбъекта2 = Поделка.НайтиЖелудь("ОписаниеОбъекта");

	// Когда

	Конфигурация1 = Новый Массив();
	ОписаниеОбъекта1.УстановитьДанные(Конфигурация1);
	Конфигурация2 = Новый Массив();
	ОписаниеОбъекта2.УстановитьДанные(Конфигурация2);
	ДанныеИдентичны = ОписаниеОбъекта1.ДанныеИдентичныОбъекту(ОписаниеОбъекта2);

	// Тогда

	Ожидаем.Что(ДанныеИдентичны, "Идентичны пустые конфигурации").Равно(Истина);
	
КонецПроцедуры

&Тест
Процедура ПроверитьЧтоИдентичныеКонфигурацииИдентичны() Экспорт

	// Дано

	Поделка = ПолучитьПоделку();
	ОписаниеОбъекта1 = Поделка.НайтиЖелудь("ОписаниеОбъекта");
	ОписаниеОбъекта2 = Поделка.НайтиЖелудь("ОписаниеОбъекта");

	// Когда

	Конфигурация1 = Новый Массив();
	Конфигурация1.Добавить("Индекс = 1;");
	Конфигурация1.Добавить("Сообщить(Индекс);");
	ОписаниеОбъекта1.УстановитьДанные(Конфигурация1);
	Конфигурация2 = Новый Массив();
	Конфигурация2.Добавить("Индекс = 1;");
	Конфигурация2.Добавить("Сообщить(Индекс);");
	ОписаниеОбъекта2.УстановитьДанные(Конфигурация2);
	ДанныеИдентичны = ОписаниеОбъекта1.ДанныеИдентичныОбъекту(ОписаниеОбъекта2);

	// Тогда

	Ожидаем.Что(ДанныеИдентичны, "Конфигурации идентичны").Равно(Истина);
	
КонецПроцедуры

&Тест
Процедура ПроверитьЧтоКонфигурацииОтличающиесяПробеломРазличны() Экспорт

	// Дано

	Поделка = ПолучитьПоделку();
	ОписаниеОбъекта1 = Поделка.НайтиЖелудь("ОписаниеОбъекта");
	ОписаниеОбъекта2 = Поделка.НайтиЖелудь("ОписаниеОбъекта");

	// Когда

	Конфигурация1 = Новый Массив();
	Конфигурация1.Добавить("Индекс = 1; ");
	Конфигурация1.Добавить("Сообщить(Индекс);");
	ОписаниеОбъекта1.УстановитьДанные(Конфигурация1);
	Конфигурация2 = Новый Массив();
	Конфигурация2.Добавить("Индекс = 1;");
	Конфигурация2.Добавить("Сообщить(Индекс);");
	ОписаниеОбъекта2.УстановитьДанные(Конфигурация2);
	ДанныеИдентичны = ОписаниеОбъекта1.ДанныеИдентичныОбъекту(ОписаниеОбъекта2);

	// Тогда

	Ожидаем.Что(ДанныеИдентичны, "Конфигурации идентичны").Равно(Ложь);
	
КонецПроцедуры

&Тест
Процедура ПроверитьЧтоКонфигурацииСРазнымКоличествомСтрокРазличны() Экспорт

	// Дано

	Поделка = ПолучитьПоделку();
	ОписаниеОбъекта1 = Поделка.НайтиЖелудь("ОписаниеОбъекта");
	ОписаниеОбъекта2 = Поделка.НайтиЖелудь("ОписаниеОбъекта");

	// Когда

	Конфигурация1 = Новый Массив();
	Конфигурация1.Добавить("Индекс = 1;");
	ОписаниеОбъекта1.УстановитьДанные(Конфигурация1);
	Конфигурация2 = Новый Массив();
	Конфигурация2.Добавить("Индекс = 1;");
	Конфигурация2.Добавить("Сообщить(Индекс);");
	ОписаниеОбъекта2.УстановитьДанные(Конфигурация2);
	ДанныеИдентичны = ОписаниеОбъекта1.ДанныеИдентичныОбъекту(ОписаниеОбъекта2);

	// Тогда

	Ожидаем.Что(ДанныеИдентичны, "Конфигурации идентичны").Равно(Ложь);
	
КонецПроцедуры